IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0c110x/SYSCTL_1.0.xml
    <register id="SYSCTL_GENCLKEN" width="32" offset="0x113C" description="General clock enable control">
        <bitfield id="EXCLKEN" description="EXCLKEN enables the CLK_OUT external clock output block." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="CLK_OUT block is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="CLK_OUT block is enabled"/>
        </bitfield>
        <bitfield id="MFPCLKEN" description="MFPCLKEN enables the middle frequency precision clock (MFPCLK)." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="MFPCLK is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="MFPCLK is enabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_PMODECFG" width="32" offset="0x1140" description="Power mode configuration">
        <bitfield id="DSLEEP" description="DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="STOP mode is entered"/>
            <bitenum id="STANDBY" value="0x1" description="STANDBY mode is entered"/>
            <bitenum id="SHUTDOWN" value="0x2" description="SHUTDOWN mode is entered"/>
            <bitenum id="RESERVED" value="0x3" description="Reserved"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FCC" width="32" offset="0x1150" description="Frequency clock counter (FCC) count">
        <bitfield id="DATA" description="Frequency clock counter (FCC) count value." begin="21" end="0" width="22" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSCTL_SRAMBOUNDARY" width="32" offset="0x1178" description="SRAM Write Boundary">
        <bitfield id="ADDR" description="SRAM boundary configuration. The value configured into this acts such that: SRAM accesses to addresses less than or equal value will be RW only. SRAM accesses to addresses greater than value will be RX only. Value of 0 is not valid (system will have no stack). If set to 0, the system acts as if the entire SRAM is RWX.  Any non-zero value can be configured, including a value = SRAM size." begin="19" end="5" width="15" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSTEMCFG" width="32" offset="0x1180" description="System configuration">
        <bitfield id="WWDTLP0RSTDIS" description="WWDTLP0RSTDIS specifies whether a WWDT Error Event will trigger a BOOTRST or an NMI." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="WWDTLP0 Error Event will trigger a BOOTRST"/>
            <bitenum id="TRUE" value="0x1" description="WWDTLP0 Error Event will trigger an NMI"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BEEPCFG" width="32" offset="0x1190" description="BEEPER Configuration">
        <bitfield id="FREQ" description="Beeper Output Frequency Configuration" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="8KHz" value="0x0" description="Beeper runs at 8KHz"/>
            <bitenum id="4KHz" value="0x1" description="Beeper runs at 4KHz"/>
            <bitenum id="2KHz" value="0x2" description="Beeper runs at 2KHz"/>
            <bitenum id="1KHz" value="0x3" description="Beeper runs at 1KHz"/>
        </bitfield>
        <bitfield id="EN" description="Beeper Output Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Beeper Output Disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Beeper Output Enabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_WRITELOCK" width="32" offset="0x1200" description="SYSCTL register write lockout">
        <bitfield id="ACTIVE" description="ACTIVE controls whether critical SYSCTL registers are write protected or not." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Allow writes to lockable registers"/>
            <bitenum id="ENABLE" value="0x1" description="Disallow writes to lockable registers"/>
        </bitfield>
    </register>
    <register id="SYSCTL_CLKSTATUS" width="32" offset="0x1204" description="Clock module (CKM) status">
        <bitfield id="LFOSCGOOD" description="LFOSCGOOD indicates when the LFOSC startup has completed and the LFOSC is ready for use." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="LFOSC is not ready"/>
            <bitenum id="TRUE" value="0x1" description="LFOSC is ready"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="ANACLKERR is set when the device clock configuration does not support an enabled analog peripheral mode and the analog peripheral may not be functioning as expected." begin="31" end="31" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No analog clock errors detected"/>
            <bitenum id="TRUE" value="0x1" description="Analog clock error detected"/>
        </bitfield>
        <bitfield id="HSCLKMUX" description="HSCLKMUX indicates if MCLK is currently sourced from the high-speed clock (HSCLK)." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="SYSOSC" value="0x0" description="MCLK is not sourced from HSCLK"/>
            <bitenum id="HSCLK" value="0x1" description="MCLK is sourced from HSCLK"/>
        </bitfield>
        <bitfield id="LFCLKMUX" description="LFCLKMUX indicates if LFCLK is sourced from the internal LFOSC, the low frequency crystal (LFXT), or the LFCLK_IN digital clock input." begin="7" end="6" width="2" rwaccess="R">
            <bitenum id="LFOSC" value="0x0" description="LFCLK is sourced from the internal LFOSC"/>
            <bitenum id="LFXT" value="0x1" description="LFCLK is sourced from the LFXT (crystal)"/>
            <bitenum id="EXLF" value="0x2" description="LFCLK is sourced from LFCLK_IN (external digital clock  input)"/>
        </bitfield>
        <bitfield id="SYSOSCFREQ" description="SYSOSCFREQ indicates the current SYSOSC operating frequency." begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="SYSOSC32M" value="0x0" description="SYSOSC is at base frequency (32MHz)"/>
            <bitenum id="SYSOSC4M" value="0x1" description="SYSOSC is at low frequency (4MHz)"/>
            <bitenum id="SYSOSCUSER" value="0x2" description="SYSOSC is at the user-trimmed frequency (16 or 24MHz)"/>
            <bitenum id="SYSOSCTURBO" value="0x3" description="Reserved"/>
        </bitfield>
        <bitfield id="FCLMODE" description="FCLMODE indicates if the SYSOSC frequency correction loop (FCL) is enabled." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description="SYSOSC FCL is disabled"/>
            <bitenum id="ENABLED" value="0x1" description="SYSOSC FCL is enabled"/>
        </bitfield>
        <bitfield id="CURMCLKSEL" description="CURMCLKSEL indicates if MCLK is currently sourced from LFCLK." begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="NOTLFCLK" value="0x0" description="MCLK is not sourced from LFCLK"/>
            <bitenum id="LFCLK" value="0x1" description="MCLK is sourced from LFCLK"/>
        </bitfield>
        <bitfield id="FCCDONE" description="FCCDONE indicates when a frequency clock counter capture is complete." begin="25" end="25" width="1" rwaccess="R">
            <bitenum id="NOTDONE" value="0x0" description="FCC capture is not done"/>
            <bitenum id="DONE" value="0x1" description="FCC capture is done"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSSTATUS" width="32" offset="0x1208" description="System status information">
        <bitfield id="SHDNIOLOCK" description="SHDNIOLOCK indicates when IO is locked due to SHUTDOWN" begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="IO IS NOT Locked due to SHUTDOWN"/>
            <bitenum id="TRUE" value="0x1" description="IO IS Locked due to SHUTDOWN"/>
        </bitfield>
        <bitfield id="EXTRSTPINDIS" description="EXTRSTPINDIS indicates when user has disabled the use of external reset pin" begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="External Reset Pin Enabled"/>
            <bitenum id="TRUE" value="0x1" description="External Reset Pin Disabled"/>
        </bitfield>
        <bitfield id="PMUIREFGOOD" description="PMUIREFGOOD is set by hardware when the PMU current reference is ready." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="IREF is not ready"/>
            <bitenum id="TRUE" value="0x1" description="IREF is ready"/>
        </bitfield>
        <bitfield id="SWDCFGDIS" description="SWDCFGDIS indicates when user has disabled the use of SWD Port" begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SWD Port Enabled"/>
            <bitenum id="TRUE" value="0x1" description="SWD Port Disabled"/>
        </bitfield>
        <bitfield id="ANACPUMPGOOD" description="ANACPUMPGOOD is set by hardware when the VBOOST analog mux charge pump is ready." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="VBOOST is not ready"/>
            <bitenum id="TRUE" value="0x1" description="VBOOST is ready"/>
        </bitfield>
        <bitfield id="REBOOTATTEMPTS" description="REBOOTATTEMPTS indicates the number of boot attempts taken before the user application starts." begin="31" end="30" width="2" rwaccess="R">
        </bitfield>
        <bitfield id="BORLVL" description="BORLVL indicates if a BOR event occured and the BOR threshold was switched to BOR0 by hardware." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No BOR violation occured"/>
            <bitenum id="TRUE" value="0x1" description="A BOR violation occured and the BOR threshold was switched to BOR0"/>
        </bitfield>
        <bitfield id="BORCURTHRESHOLD" description="BORCURTHRESHOLD indicates the active brown-out reset supply monitor configuration." begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="BORMIN" value="0x0" description="Default minimum threshold; a BOR0- violation triggers a BOR"/>
            <bitenum id="BORLEVEL1" value="0x1" description="A BOR1- violation generates a BORLVL interrupt"/>
            <bitenum id="BORLEVEL2" value="0x2" description="A BOR2- violation generates a BORLVL interrupt"/>
            <bitenum id="BORLEVEL3" value="0x3" description="A BOR3- violation generates a BORLVL interrupt"/>
        </bitfield>
    </register>
